jayzane/esp32-rabbit/sdkconfig.defaults
# ESP32-WROVER-DEV Board Configuration
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# Camera Configuration - OV2640
CONFIG_CAMERA_OV2640=y

# PSRAM for dual framebuffer
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=n
CONFIG_SPIRAM_MODE_OCT=n
CONFIG_SPIRAM_OCKED_EN=y
CONFIG_SPIRAM_USE_MEMMAP=n
CONFIG_SPIRAM_USE_CAPS_ALLOC=n
CONFIG_SPIRAM_USE_CHRONES_ALLOC=n
CONFIG_SPIRAM_SIZE="-1"
CONFIG_SPIRAM_HP_SIZE=0
CONFIG_SPIRAM_EXEC=y

# Framebuffer settings
CONFIG_CAMERA_FB_SZ_VGA=y

# Disable unused features to save memory
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Disable WiFi/BT if not needed initially
CONFIG_ESP32_WIFI_SW_COEXIST_ENABLE=n
CONFIG_ESP32_ENABLE_WIFI=n
CONFIG_ESP32_ENABLE_BT=n
